app/Controllers/GameController.php

    public function create() {
        $model = new GameModel();
        $data = $this->request->getPost();

        if ($model->insertGame($data)) {
            return redirect()->to('games/list')->with('success', 'Juego añadido correctamente.');
---
SELECT *
FROM `juego`