app/Models/GameModel.php

SELECT *
FROM `info_juego`
ORDER BY `titulo_juego` ASC
---
    public function getGameDetails() {
        $builder = $this->db->table('info_juego');
        $builder->select('*');
        $builder->orderBy('titulo_juego', 'ASC');
        return $builder->get()->getResult();

SELECT *
FROM `info_juego`
WHERE `titulo_juego` = 'juegomio'
---
    public function checkInfoExists($titulo) {
        $builder = $this->db->table('info_juego');
        $builder->select('*');
        $builder->where('titulo_juego', $titulo);
        return $builder->get()->getRow();

INSERT INTO `juego` (`plataforma`, `titulo`, `precio`, `rebaja`, `stock`, `formato`, `id_info`) VALUES ('Nintendo Switch', 'juegomio', '33', '33', '3', '0', '13')
---
    public function insertGame($data) {
        $db = db_connect();
        $db->transStart();

        // Check if info exists and get id_info
        $infoExists = $this->checkInfoExists($data['titulo']);
        if (!$infoExists && (!empty($data['descripcion']) && !empty($data['genero']) && !empty($data['imagen']))) {
            $db->table('info_juego')->insert([
                'titulo_juego' => $data['titulo'],
                'genero' => $data['genero'],
                'descripcion' => $data['descripcion'],
                'imagen' => $data['imagen']
            ]);
            $data['id_info'] = $db->insertID();